src/cf/InformationRegisters/GDS_ПринятыеОригиналыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ПринятыеОригиналыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КакПринят</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ВидыПринятияОригиналаДокумента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/GDS_ВидыПринятияОригиналаДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_ВидыПринятияОригиналаДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штрихкод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonForms/GDS_ПриемДокументовПоШтрихкоду/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КоличествоПринятыхДокументов = 0; 
	ОбновитьСведенияОКоличествеПринаыхДокументах();
	
	//ПодключаемоеОборудование
	уатОбщегоНазначения_проф.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	//Конец ПодключаемоеОборудование
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ДопПараметры = Новый Структура;
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Штрихкод = уатОбщегоНазначенияКлиент.ПолучитьШтрихкодПоДаннымСобытия(Параметр);
			Если Штрихкод <> "" Тогда
				ТекОбъект = уатЗащищенныеФункцииСервер_проф.ПолучитьОбъектПоШтрихкоду(Штрихкод, ДопПараметры.Свойство("ЭтоКартаДоступа"));	
				Если ЗначениеЗаполнено(ТекОбъект) Тогда
					ПринятьОбъектПоШтрихкодуНаСервере(ТекОбъект);
				Иначе
					Сообщить("Документ со штрихкодом: " + Штрихкод + " НЕ НАЙДЕН!"); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Процедура ПринятьОбъектПоШтрихкодуНаСервере(ТекОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_ПринятыеОригиналыДокументовСрезПоследних.Период КАК Период,
		|	GDS_ПринятыеОригиналыДокументовСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.GDS_ПринятыеОригиналыДокументов.СрезПоследних КАК GDS_ПринятыеОригиналыДокументовСрезПоследних
		|ГДЕ
		|	GDS_ПринятыеОригиналыДокументовСрезПоследних.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ТекОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщить("Документ: " + ТекОбъект + " бал принят " + ВыборкаДетальныеЗаписи.Период + " " + ВыборкаДетальныеЗаписи.Пользователь); 
	Иначе
		МенеджерЗаписи = РегистрыСведений.GDS_ПринятыеОригиналыДокументов.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Документ = ТекОбъект;
		МенеджерЗаписи.Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
		МенеджерЗаписи.КакПринят = Перечисления.GDS_ВидыПринятияОригиналаДокумента.Штрихкод;
		МенеджерЗаписи.Записать();
		
		КоличествоПринятыхДокументов = КоличествоПринятыхДокументов + 1;
		ОбновитьСведенияОКоличествеПринаыхДокументах();
		
		Сообщить("Документ: " + ТекОбъект + " ПРИНЯТ!"); 
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьСведенияОКоличествеПринаыхДокументах()

	СведенияОКоличествеПринаыхДокументах = Новый ФорматированнаяСтрока("",Новый ФорматированнаяСтрока(НСтр(
		"ru = 'Количество'"), , Новый Цвет(60, 100, 190)), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = ' принятых документов: %1'"), КоличествоПринятыхДокументов));

КонецПроцедуры
